#include "input.h"
#include "color.h"

/**
 * @brief Информация
 * 
 * Функция для вывода информации о приложении и инструкций по его эксплуатации
*/
void print_instructions(void)
{
    printf("Программа для умножения двух действительных чисел.\n");
    printf("%sФормат ввода: [+-]?[0-9]*[.]?[0-9]*E[+-][0-9]*%s\n", BOLD, RESET);
    printf("Примечания:\n");
    printf("1. Знак перед мантиссой и порядком является необязательным.\n");
    printf("2. Точка может быть до числа (.55 => 0.55), может быть после (55. => 55.0).\n");
    printf("3. В числе должна присутствовать хотя бы одна цифра (до или после точки).\n");
    printf("4. Если при вводе используется 'E', то после него обязательно должна быть хотя бы одна цифра.\n");
    printf("5. Согласно условию длина 1-ого множителя до 35-ти значащих цифр, 2-ого - до 40, длина результата - до 40. Величина порядка 5 цифр.\n");
    printf("\n");
}