#include "print_instructions.h"

status_t print_menu(void)
{
    printf("+------------------------------------------------------------+\n");
    printf("|                            Меню                            |\n");
    printf("+------------------------------------------------------------+\n");
    printf("| 0  - Выйти из программы                                    |\n");
    printf("| 1  - Прочитать файл                                        |\n");
    printf("| 2  - Вывести данные                                        |\n");
    printf("| 3  - Вывести таблицу ключей                                |\n");
    printf("| 4  - Добавить запись                                       |\n");
    printf("| 5  - Удалить запись                                        |\n");
    printf("| 6  - Отсортировать по цене (быстрая сортировка)            |\n");
    printf("| 7  - Отсортировать по цене (медленная сортировка)          |\n");
    printf("| 8  - Отсортировать таблицу ключей (быстрая сортировка)     |\n");
    printf("| 9  - Отсортировать таблицу ключей (медленная сортировка)   |\n");
    printf("| 10 - Вывести данные по таблице ключей                      |\n");
    printf("| 11 - Вывести таблицу эффективности                         |\n");
    printf("| 12 - Вывести список балетов для детей                      |\n");
    printf("+------------------------------------------------------------+\n");

    return SUCCCESS_CODE;
}