#include "print_instructions.h"

status_t print_menu(void)
{
    printf("+------------------------------------------------------------+\n");
    printf("|                            Меню                            |\n");
    printf("+------------------------------------------------------------+\n");
    printf("| 0  - Выйти из программы                                    |\n");
    printf("| 1  - Прочитать файл                                        |\n");
    printf("| 2  - Вывести данные                                        |\n");
    printf("| 3  - Вывести таблицу ключей                                |\n");
    printf("| 4  - Добавить запись                                       |\n");
    printf("| 5  - Удалить запись                                        |\n");
    printf("| 6  - Отсортировать по цене (быстрая сортировка)            |\n");
    printf("| 7  - Отсортировать по цене (медленная сортировка)          |\n");
    printf("| 8  - Отсортировать таблицу ключей (быстрая сортировка)     |\n");
    printf("| 9  - Отсортировать таблицу ключей (медленная сортировка)   |\n");
    printf("| 10 - Вывести данные по таблице ключей                      |\n");
    printf("| 11 - Вывести таблицу эффективности                         |\n");
    printf("| 12 - Вывести список балетов для детей                      |\n");
    printf("+------------------------------------------------------------+\n");

    return SUCCCESS_CODE;
}

status_t print_read_file_comments(void)
{
    printf("=======================  ЧТЕНИЕ ФАЙЛА  =======================\n");
    printf("При чтении файла и записи новых данных старые будут удалены.\n");
    printf("Данные в файле для чтения должны храниться определенным образом.\n");
    printf("Желательно использовать латинницу. Пример валидной записи структуры:\n");
    printf("HypeTheater HypePlay 120 700 MUSICAL HypeComposer HypeCountry MUSICAL_SHOW 10 112\n");
    printf("Некоторые поля в завистимости от типа структуры должны быть числовыми.\n");
    printf("Некоторые поля обязаны содержать константные значения (одно из).\n");
    printf("Желательно, чтобы длина названий или чисел не превышала 8-13 символов,\n");
    printf("иначе поплывет таблица, обязательно, чтобы они были не длиннее 128 символов.\n");
    printf("Если какое-либо значение оказалось длиннее 128 символов, оно будет беспощадно обрезано.\n");
    printf("Длительность мюзиклов указывается в минутах, возраст посетителей - в годах.\n");
    printf("При несоблюдении вышеуказанных инструкций ввод данных будет прекращен.\n");
    printf("При успешности ввода данных по прихоти автора будет выведена таблица с новыми данными.\n");

    return SUCCCESS_CODE;
}