#include "output.h"


status_t print_menu(void)
{
    printf("+--------------------------------------------------+\n");
    printf("|                        Меню                      |\n");
    printf("+--------------------------------------------------+\n");
    printf("| 0  - Выйти из программы                          |\n");
    printf("+--------------------------------------------------+\n");
    printf("|                    М А С С И В                   |\n");
    printf("+--------------------------------------------------+\n");
    printf("| 1 - вычислить арифиметическое выражение          |\n");
    printf("| 2 - добавить элемент в стек                      |\n");
    printf("| 3 - удалить элемент из стека                     |\n");
    printf("| 4 - вывести стек                                 |\n");
    printf("+--------------------------------------------------+\n");
    printf("|                    с П И С О К                   |\n");
    printf("+--------------------------------------------------+\n");
    printf("| 5 - вычислить арифиметическое выражение          |\n");
    printf("| 6 - добавить элемент в стек                      |\n");
    printf("| 7 - удалить элемент из стека                     |\n");
    printf("| 8 - вывести стек                                 |\n");
    printf("+--------------------------------------------------+\n");
    printf("| 9 - Сравнить производительность                  |\n");
    printf("| 10 - Вывести массив свободных областей памяти    |\n");
    printf("+--------------------------------------------------+\n");

    return SUCCESS_CODE;
}