#ifndef __EFFICIENCU_H__
#define __EFFICIENCU_H__

#include "data.h"
#include "simulate.h"
#include "output.h"
#include <time.h>
#include <stdlib.h>
#include <stdio.h>

#define EFFICIENCY_ITERATIONS_QUANTITY 1000
#define FILL_N_EMPTY_ITERATIONS_QUANTITY 100

/** @brief Функция для замера эффективности на данных, собранных
 * в процессе запущенных EFFICIENCY_ITERATIONS_QUANTITY симуляциях.
 * 
 * Запускает EFFICIENCY_ITERATIONS_QUANTITY раз симуляцию для массива, делает замеры
 * времени, затем аналогично для списка, высчитывает среднее время выполнения
 * симуляции и объем памяти, занимаемый объектами симуляции. Выводит таблицу сравнения эффективности.
 * 
 * @return Статус выполнения функции
*/
status_t measure_efficiency(void);

/** @brief Функция для просмотра адресов добавляемых и удаляемых элементов очереди массива.
 * 
 * Заполняет очередь (массив) элементами (количество элементов равно FILL_N_EMPTY_ITERATIONS_QUANTITY).
 * Согласно правилам заполнения очередей (FIFO) записывает адреса элементов 
 * в массив адресов. Затем аналогичным образом удаляет элементы из массива, так же сохраняя 
 * адреса в специальном массиве. Выводит на экран все зафиксированные адреса в табличном представлении.
 * 
 * @return Статус выполнения функции
*/
status_t fill_and_empty_arr_queue(void);

/** @brief Функция для просмотра адресов добавляемых и удаляемых элементов очереди списка.
 * 
 * Заполняет очередь (список) элементами (количество элементов равно FILL_N_EMPTY_ITERATIONS_QUANTITY).
 * Согласно правилам заполнения очередей (FIFO) записывает адреса элементов 
 * в массив адресов. Затем аналогичным образом удаляет элементы из массива, так же сохраняя 
 * адреса в специальном массиве. Выводит на экран все зафиксированные адреса в табличном представлении.
 * 
 * @return Статус выполнения функции
*/
status_t fill_and_empty_list_queue(void);

/** @brief Функция для сравнения времени выполнения операций push и pop в контексте
 * их выполнения на массивной очереди и очереди на основе списка.
 * 
 * @return Статус выполнения функции.
*/
status_t compare_push_and_pop(void);

#endif