#include "output.h"


status_t print_menu(void)
{
    printf("%s", BLUE);
    printf("╔═════════════════════════════════════════════╗\n");
    printf("║                   M E N U                   ║\n");
    printf("╠═════════════════════════════════════════════╣\n");
    printf("║ 0. Выход                                    ║\n");
    printf("║ 1. Запустить симуляцию массивом             ║\n");
    printf("║ 2. Запустить симуляцию списком              ║\n");
    printf("║ 3. Оценить эффективность                    ║\n");
    printf("║ 4. Посмотреть информацию о памяти           ║\n");
    printf("║ 5. Настроить параметры симуляции            ║\n");
    printf("╚═════════════════════════════════════════════╝\n");
    printf("%s", RESET);

    return SUCCESS_CODE;
}